blog/_protected/views/site/index.php

SELECT * FROM `posts` WHERE `status`='active'
---
use app\models\Posts;

$this->title = Yii::t('app', Yii::$app->name);
$posts = Posts::find()->where(['status'=>'active'])->all();