blog/_protected/controllers/PostsController.php

INSERT INTO `posts` (`date_time`, `title`, `image`, `post`, `status`, `user_id`) VALUES ('2018-11-10 02:37:33', 'just my first blog', 'uploads/salary.jpg', '<p>this is my first blog.</p>\r\n\r\n<p>&lt;code&gt;&lt;h1&gt;Yes dude&lt;/h1&gt;&lt;/code&gt;</p>\r\n', 'active', 1)
---
    public function actionCreate()
    {
        $model = new Posts();

        if ($model->load(Yii::$app->request->post())) {
            $m = new UploadForm();
            $m->file = UploadedFile::getInstance($model, 'image');
            $file_name = '';
            if ($m->file && $m->validate()) {
                $file_name = 'uploads/' . $m->file->baseName . '.' . $m->file->extension;
                $m->file->saveAs($file_name);
            }
            $model->image = $file_name;
            if($model->validate() && $model->save()){

SELECT * FROM `posts` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Posts::findOne($id)) !== null) {